{"keras_version": "1.1.1", "config": [{"config": {"activity_regularizer": null, "input_dtype": "float32", "border_mode": "same", "trainable": true, "bias": true, "name": "convolution2d_1", "W_constraint": null, "subsample": [1, 1], "nb_filter": 32, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "b_constraint": null, "nb_row": 3, "activation": "linear", "dim_ordering": "tf", "batch_input_shape": [null, 128, 128, 3], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "activation": "linear", "border_mode": "valid", "trainable": true, "name": "convolution2d_2", "W_constraint": null, "subsample": [1, 1], "nb_filter": 32, "init": "glorot_uniform", "bias": true, "nb_col": 3, "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "output_dim": 128, "trainable": true, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "input_dim": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "output_dim": 1, "trainable": true, "name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "input_dim": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}